Tekla.Structures.Drawing.MarkSymbolShape
The mark symbol shapes for the detail mark.

Tekla.Structures.Drawing.MarkSymbolShape.None
No shape.

Tekla.Structures.Drawing.MarkSymbolShape.Circular
The circular shape.

Tekla.Structures.Drawing.MarkSymbolShape.SlashedCircular
The slashed circular shape.

Tekla.Structures.Drawing.MarkSymbolShape.Custom
The custom shape.